app/controllers/videos_controller.rb

  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("wista", "description", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?, ?)  [["wista", "star war"], ["description", "teastplease ingnore it "], ["created_at", "2019-03-05 12:51:44.769191"], ["updated_at", "2019-03-05 12:51:44.769191"], ["title", "title test one"]]

  def update
    respond_to do |format|
      if @video.update(video_params)
---
UPDATE "videos" SET "wista" = ?, "description" = ?, "title" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["wista", "test3"], ["description", "qwerqwerqwerqewreqwrewq"], ["title", "title test oneqer"], ["updated_at", "2019-03-05 14:38:50.694917"], ["id", 5]]

  def destroy
    @video.destroy
---
DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 1]]